import React from "react";
import "./Newsupdate.css";

const Newsupdates = () => {
  return (
    <div className="Newsupdates">
      <div className="Newsupdates-title">News and Updates</div>
      <ul className="Newsupdates-ul">
        <li>
          Devotees can pay ONLINE - https://tms.ap.gov.in/MDSMPL/cnt/index
        </li>

        <li>
          శ్రీ మందేశ్వర స్వామివారి ఆలయంలో స్వయంగారాలేని భక్తులు చెల్లించు రుసుము
          ద్వారా ఆలయ అర్చకులచే జరుగు పరోక్ష తైలాభిషేకములు భక్తుల సౌకర్యార్థం
          ప్రతి శనివారం ఉదయం 12.00 గంటలకు (శనిత్రయోదసి రోజు మాత్రం పూజ జరుగు
          సమయం మార్చబడును) శ్రీ స్వామివారి Youtube ఛానెల్
          https://youtube.com/c/SriMandeswaraMandapalli ద్వారా ప్రత్యక్షప్రసారం
          గా జరిపించబడును కావున భక్తులు ఈ ఛానెల్ ని subscribe చేసుకుని తమ తరుపున
          జరుగుపరోక్ష తైలాభిషేకం కనులారా వీక్షించి శ్రీ స్వామివారి అనుగ్రహానికి
          పాత్రులు కాగలరని తెలియచేయడమైనది.🙏
        </li>

        <li>
          ANNADANAM has started by the Sri Mandeswara Swamy vari Devasthanam on
          SATURDAYS for devotees coming from various places
        </li>

        <li>
          Sri Mandeswara (Saneswara) Swamy Devasthanam is proudly launching
          "ONLINE" service from 27-Oct-2013. Devotees can pay pooja tickets
          through Debit/Credit cards
        </li>
        <li>
          తైలాభిషేకం చేయించుకును భక్తులు దేవస్థానం వారు తెలిపిన రేట్లు ప్రకారం
          పంపిన మొత్తనకు రశీదు, కుంకుమ మొత్తనకు రశీదు, కుంకుమ మొత్తనకు రశీదు,
          కుంకుమ ప్రసాదం పంపబడును. లేనిచో పై రేట్లు కంటే తక్కువ పంపిన యెడల ఆ
          సొమ్మును శ్రీ స్వామి వారి ఎకౌంటునకు జమ చేయబడును. కావున
          తెలియపరచుచున్నాము.
        </li>
        <li>
          శని త్రయోదశి పర్వదినములలో తప్ప ప్రతిరోజు అభిషేకములు జరిపించుకొనే వేళలు
          ఆదివారం నుండి శుక్రవారం వరకు ఉదయం 5 గం॥ల నుండి మధ్యాహ్నం 12 గం॥ల వరకు
          శనివారం ఉదయం 4 గం॥ల నుండి మధ్యాహ్నం 12 గం॥ల వరకు అభిషేకములు జరుగును.
          తిరిగి సాయంత్రం 4 గం||ల నుండి రాత్రి 7 గం||ల వరకు దర్శనం మాత్రమే
          జరుగును.
        </li>
        <li>2023 మాస శివరాత్రి తేదీలు</li>
        <li>
          1. 18-04-2023 <br />
          2. 18-05-2023 <br />
          3. 16-06-2023 <br />
          4. 15-07-2023 <br />
          5. 14-08-2023 <br />
          6. 13-09-2023 <br />
          7. 12-10-2023 <br />
          8. 11-11-2023 <br />
          9. 11-12-2023
        </li>
        <li>2024 మాస శివరాత్రి తేదీలు</li>
        <li>
          1. 09-01-2024 <br />
          2. 08-02-2024 <br />
          3. 08-03-2024 <br />
          4. 07-04-2024 <br />
          5. 06-05-2024 <br />
          6. 04-06-2024 <br />
          7. 04-07-2024 <br />
          8. 02-08-2024 <br />
          9. 01-09-2024 <br />
          10. 30-09-2024 <br />
          11. 30-10-2024 <br />
          12. 29-11-2024 <br />
          13. 29-12-2024
        </li>
      </ul>
    </div>
  );
};

export default Newsupdates;
