import React from 'react'

const About = () => {
  return (
    <start>
        <div>
          <br />
      పురాణ గాథ :
      పూర్వం అశ్వత్థ, పిప్పలాదులనే రాక్షసులు ఈ ప్రాంతంలో తపస్సు చేసుకునే మునులను సంహరించి భక్షించేవారు. అప్పుడు వారంతా వెళ్ళి అక్కడే పరమేశ్వరుని తపస్సులో ఉన్న శనీశ్వరునితో మొరపెట్టుకున్నారు. వారి మొరను ఆలకించిన మందుడు ఆ రాక్షసులను హతమార్చాడు. అసుర సంహారం వల్ల కలిగిన బ్రహ్మహత్యా పాతకాన్ని నివారించుకొనేందుకు మందపల్లిలో శివాలయాన్ని ప్రతిష్ఠించి పూజలు చేశాడు. అప్పట్నుంచీ ఆ ఆలయం శనైశ్చరాలయంగా ప్రసిద్ధి గాంచింది. 

      <br />
      <br />

      పురాణ గాథ :
పూర్వం అశ్వత్థ, పిప్పలాదులనే రాక్షసులు ఈ ప్రాంతంలో తపస్సు చేసుకునే మునులను సంహరించి భక్షించేవారు. అప్పుడు వారంతా వెళ్ళి అక్కడే పరమేశ్వరుని తపస్సులో ఉన్న శనీశ్వరునితో మొరపెట్టుకున్నారు. వారి మొరను ఆలకించిన మందుడు ఆ రాక్షసులను హతమార్చాడు. అసుర సంహారం వల్ల కలిగిన బ్రహ్మహత్యా పాతకాన్ని నివారించుకొనేందుకు మందపల్లిలో శివాలయాన్ని ప్రతిష్ఠించి పూజలు చేశాడు. అప్పట్నుంచీ ఆ ఆలయం శనైశ్చరాలయంగా ప్రసిద్ధి గాంచింది. 
    </div>
    </start>
  )
}

export default About