import React from 'react'
import './About.css'

const About = () => {
  return (
    <div className='About'>
      <div className='history'>
      <header>పురాణ గాథ :</header>
        పూర్వం అశ్వత్థ, పిప్పలాదులనే రాక్షసులు ఈ ప్రాంతంలో తపస్సు చేసుకునే మునులను సంహరించి భక్షించేవారు. అప్పుడు వారంతా వెళ్ళి అక్కడే పరమేశ్వరుని తపస్సులో ఉన్న శనీశ్వరునితో మొరపెట్టుకున్నారు. వారి మొరను ఆలకించిన మందుడు ఆ రాక్షసులను హతమార్చాడు. అసుర సంహారం వల్ల కలిగిన బ్రహ్మహత్యా పాతకాన్ని నివారించుకొనేందుకు మందపల్లిలో శివాలయాన్ని ప్రతిష్ఠించి పూజలు చేశాడు. అప్పట్నుంచీ ఆ ఆలయం శనైశ్చరాలయంగా ప్రసిద్ధి గాంచింది.
      </div>

      <div className='importance'>
      <header>ప్రాముఖ్యత :</header>
        మందపల్లి శనీశ్వర స్వామి ఇతర ఆలయాలకు కాస్తంత భిన్నం. వాస్తవానికి సోమేశ్వర స్వామి ఆలయం అయినా, శనీశ్వరుడు ప్రతిష్ఠించడంతో శనీశ్వర ఆలయంగా ప్రసిద్ధి చెందింది. శత్రు, రోగ, రుణ బాధల నుంచి విముక్తి కోసం వేలాదిమంది భక్తులు వస్తుంటారు. జాతక చక్రంలో శనితో సమస్యలున్నవారు కూడా వస్తుంటారు. ఏటా శ్రావణ మాసం లోనూ, శనిత్రయోదశి వచ్చే రోజుల్లోనూ మందేశ్వరుడికి ప్రత్యేక పూజలు నిర్వహిస్తారు.శనిత్రయోదశి నాడు, మహాశివరాత్రి రోజున ఇక్కడికి వచ్చేవారి సంఖ్య వేలల్లో ఉంటుంది. శనీశ్వరుడికి తైలంతో ఇక్కడ అభిషేకం చేస్తారు. నల్లటి వస్త్రాలు దానం చేస్తారు. కోర్టు కేసులు, శత్రువులు, రోగాలు, రుణాలు నుంచి విముక్తుల్ని చేయాల్సిందిగా మొక్కుకుని, వారి కోర్కెలు తీరిన తరువాత మొక్కులు చెల్లిస్తుంటారు.
      </div>


      <div className='power'>
      <header>స్థల మహాత్యం :</header>
        పూర్వకాలం అగస్త్యమహర్షి దక్షిణ దిక్కున సత్రయాగంను చేయుటకై గౌతమీ నదీ తీరానికి చేరి సంవత్సరం సత్రయాగం చేయుటానికి దీక్షితుడయ్యాడు. ఆ సమయాన కైటభుడనే రాక్షసుని కొడుకులగు ధర్మకంటకులయిన అశ్వర్ధుడు, పిప్పలుడు యను యిరువురు రాక్షసులు దేవలోకంలో కూడా ప్రసిధ్ధి చెందినవారై యుండిరి. వారిరువురిలో అశ్వర్ధుడు రావిచెట్టు రూపములోనూ, పిప్పలుడు బ్రాహ్మణరూపములోను యుండి సమయము జూసి యజ్ఞమును నాశనం చేయుటకుపక్రమించిరి. వారిలో రావిచెట్టు రూపములోనున్న అశ్వర్ధుడు ఆ వృక్షం నీడలో ఆశ్రయం పొందు బ్రాహ్మణులను దినుచుండెను.పిప్పలుడు సామవేదము నేర్చుకొనుటకు వచ్చిన శిష్యులను తినుచుండెను. అంతట దిన దినము బ్రాహ్మణులు క్షీణించుటను చూచి వృద్ధులగు మహర్షులు గౌతమీ దక్షిణ తటాకమున నియత వ్రతుడై తపస్సు నాచరించుచున్న సూర్యపుత్రుడగు శనిని చూచి ఈ ఘోరమగు రాక్షస కృత్యములను నివేదించి, ఈ రాక్షసుల నిరువురిని వధించమని కోరిరి. అప్పుడు ఆ శని ఋషులతో నిట్లు పలికెను. దానికి శనిదేవుడు తన తపస్సు పూర్తి కాగానే వారిని వధించెదనని మాట యిచ్చెను. దానికి మహర్షులు తమ తపస్సును శనికి యిచ్చెదమని సంహరించమనీ ప్రార్థించిరి. అంతట శని బ్రాహ్మణ వేషమున దాల్చి వృక్షరూపముగ నున్న అశ్వర్ధుని వద్దకు వెళ్ళి ప్రదక్షిణములు చేయనారంభించెను. అంతట అశ్వర్ధుడు రాక్షసుడు ఈ శనిని మామూలు బ్రాహ్మణుడే యనుకుని అలవాటు చొప్పున మ్రింగివేసెను. అప్పుడు శని ఆ రాక్షసుని దేహమున ప్రవేశించి రాక్షసుని ప్రేవులను త్రెంచివేసెను. వెంటనే అతడు భస్మీభూతుడయ్యెను.ఆ వెంటనే బ్రాహ్మణ వేషమున గల రెండవ రాక్షసుడగు పిప్పలుని వద్దకు సామవేదము అభ్యసించుటకు వచ్చినానని బ్రాహ్మణ వటరూపమున శిష్యుని వలె వినయపూర్వకముగా వెళ్ళెను. అంతట ఆ పిప్పలుడు ఈ సూర్య పుత్రుడగు శనిని అలవాటు ప్రకారముగా భక్షించెను. అంతట శని ఆ రాక్షసుని ప్రేవులు కూడా చూచిన మాత్రముననే ఆ రాక్షసుడు భస్మమాయెను.

        ఆ యిరువురు రాక్షసులను సంహరించిన శనికి మహర్షులందరూ వరములనిచ్చిరి. సంతుష్టుడై శని గూడ బ్రాహ్మణులతో నిట్ల పలికెను.

        నా వారము ఏ జనులైతే నియతవ్రతులై అశ్వత్ధవృక్షమునకు ప్రదక్షిణము చేయుదురో వారి కోరికలన్నియు నీరేడును. వారికి నా పీడ కలగదు. ఈ అశ్వత్థ తీర్థమున ఈ శనైశ్చర తీర్ధమున ఎవరైతే స్నానము చేయుదురో వారు సమస్త కార్యములు తీర్ధములు నిర్విఘ్నముగా కొనసాగును. శని వారము రోజున అశ్వద్ధ ప్రదక్షిణములు చేసిన వార్కి గ్రహపీడ కలుగదు. ఈ తీర్ధమునందు స్నానదానము చేసిన హేమదాన ఫలము లభించును అని శని వరములను యిచ్చెను. అప్పటి నుండి ఈ ప్రదేశములో అశ్వత్థ తీర్థము, పిప్పళ తీర్ధము, సానుగ తీర్ధము, అగస్త్యతీర్ధము, సాత్రికతీర్ధము, యగ్నిక తీర్ధము, సాముగ తీర్ధము నొదలగుగా గల పదునాలుగువేల నూట ఎనిమిది తీర్ధములు అనేకమంది ఋషులచేతను, దేవతల చేతను, కల్పించబడి ప్రసిద్ధి చెందిన స్నాన జపపూజాదులను స్వల్ప భక్తజనులకు సమస్త కార్యసిద్ధులు చేకూర్చిన సతయాగ ఫలము లభింపచేయుచున్నవి.

        యిచ్చట ఈశని సామగాన కోవిదులగు బ్రాహ్మణ సంతతి వారగు రాక్షసులను సంహరించి బ్రహ్మ హత్య దోష పరిహారముకై లోక సంరక్షణకై సర్వలోకేశ్వరుడగు సర్వదురిత సంహారకుడగు, కరుణామయుడగు శివుని ప్రతిష్ఠ చేసెను. తనచే ప్రతీష్టింపబడిన శివునికి నువ్వులను అభిషేకము జరిపించిన వార్కి సమస్త కోరికలు నీడేరునట్లుగను తన బాధ యితర గ్రహపీడ మొదలైనవిలేకుండునట్లగను శని వరములు నిచ్చెను. అంతట శనిచే ప్రతిష్ఠింపబడిన ఈశ్వరునికి శనేశ్వరుడనియు కూడా ప్రసిద్ధ నామాంతరము కలిగెను. పిమ్మట ఈ మందేశ్వరునికి ప్రక్కనే సప్తమాత్రుకలు వచ్చి శ్రీ పార్వతిదేవిని ప్రతిష్ఠించిరి. ఈ ఈశ్వరునికి బ్రహ్మేశ్వరుడని పేరు. దీనికి ప్రక్కనే అష్ట మహానాగులలో ఒకడగు కర్కోటకుడను నాగుచే ప్రతిష్ఠింపబడిన ఈశ్వరునికి నాగేశ్వరుడని పేరు. ఈ పక్కనే సప్త మహర్షులలో నొకడగు గౌతమి మహర్షిచే ప్రతిష్ఠింపబడిన శ్రీ వేణుగొపాలస్వామి మూర్తి ఉంది. మొత్తము మీద ఒకే పెద్ద ప్రాకారములో వరుసగా ఐదు దేవాలయములు కలిగి భక్తి జనాహ్లాదకరముగా నుండును. పూజాతత్పరులకు సమస్త భక్తులకు సమస్త కోరికలు నీరేడుటయే గాక అంత్య కాలములో మోక్షసామ్రాజ్యము నొందెదురు.
      </div>

    </div>
  )
}

export default About