import React from "react";
import "./AboutTemple.css";
function AboutTemple() {
  return (
    <div className="aboutTemple-container">
      <div className="aboutTemple-heading">About Temple</div>
      <div className="aboutTemple-description">
        <div className="aboutTemple-data">
          పూర్వకాలంలో కొన్ని యుగాల క్రితం ఈ మందపల్లి గ్రామ ప్రాంతమంతా
          దండకారణ్యముగా ఉండగా ఈ ప్రాంతమునందు ఋషులు,మహర్షులు యజ్ఞయాగాదులు
          చేసుకొనుచుండెడివారు ఆసమయమున అశ్వత్థుడు, పిప్పలుడు అను ఇరువురు
          రాక్షసులు దేవలోకములో కూడా ప్రసిద్ధి చెందిన వారైయుండిరి వారిరువురులో
          అశ్వత్థుడు రావిచెట్టు రూపములోను, పిప్పలుడు బ్రాహ్మణ రూపములోను యుండి
          సమయం చూచి యజ్ఞయాగదులకి ఆటంకం కలిగించుచూ వచ్చిన బ్రాహ్మణులని
          తినుచుండెడివారు అంతటా దినదినమున బ్రాహ్మణులు క్షీణించుటను చూసి
          వృద్ధులగు మహర్షులు గౌతమి దక్షిణ తటమున తపస్సు నాచరించుచున్న
          సూర్యపుత్రుడగు " శనైశ్చరుని చూసి ఈ ఘోరమగు రాక్షస కృత్యములను నిరోధించి
          ఈ ఇద్దరు రాక్షసులను వధించమని కోరిరి, పిమ్మట శనైశ్చరుడు నా తపస్సు
          కాగానే ఇరువుని రాక్షసులను వధించెదనని చెప్పెను అంతట మహర్షులు మేము మా
          తపశక్తిని నీకిచ్చెదము నీవు వెంటనే ఆ రాక్షసులను సంహరింపమని కోరిరి, అంతట
          శనైశ్చరుడు బ్రాహ్మణ వేషము దాల్చి వృక్షరూపములో ఉన్న అశ్వత్థుడుని అదే
          విధముగా బ్రాహ్మణుని రూపంలో గల పిప్పలునిని ఇద్దరి రాక్షసులను
          సంహరించెను.
        </div>
        <button className="aboutTemple-button">Read More</button>
      </div>
    </div>
  );
}

export default AboutTemple;
